//Создайте объект на основе ваших данных. Имя, фамилия, почта, работа, должность, возраст, страна, город, статус 
// отношений и так далее. Чем больше - тем лучше (но не увлекайтесь, до 10 максимум). Подберите правильное название 
// для переменной.

const personalData = {
  name : "Asset",
  surname : "Moldashev",
  email : "asset.freelancer@gmail.com",
  job : "freelancer",
  post : "Технический специалист",
  age : "39",
  county : "Kazakhstan",
  city : "Taraz",
  relation : "married",
  children : "5"
}

//Создайте объект, который будет хранить данные об автомобиле (марка, модель, год выпуска, цвет, вид коробки). 
// Добавьте дополнительное свойство - владелец авто, значением которого будет ОБЪЕКТ, описанный в пункте №3. 
// Желательно добавлять отдельной строкой (имеется ввиду не при создании объекта)

const myCar = {
  stamp: "Ford",
  model: "Explorer",
  year: "2015",
  color: "white",
  transmission: "auto",
  owner: personalData
}

//Написать функцию которая аргументом будет принимать объект, описанный в пункте №4. Она проверяет, есть ли в 
// объекте свойство "максимальная скорость", если нет - добавляет его и задает значение, если есть - прекращает 
// выполнение (ничего не делает)

const showCarInfo = (maxSpeed) => {
  if ("maxSpeed" in myCar) {
    return
  } else {
    myCarInfo = {...myCar, maxSpeed}
  }
}

showCarInfo("280");
console.log(myCarInfo);

//Написать функцию, которая получает первым аргументом — объект, а вторым аргументом — свойство объекта, которое 
// нужно вывести и выводит его значение.

function getDataObject(obj,key) {
  console.log(obj[key]);
}

const person = {
  name: "Asset",
  age:"39"
}

getDataObject(person, "name");
getDataObject(person, "age");

//Создать массив, который содержит названия продуктов (просто строки)

const vegetables = ['Картошка', 'Лук', 'Помидор', 'Баклажана']

//Создать массив, состоящий из объектов, где объект представляет собой книгу (название, автор, год выпуска, 
// цвет обложки, жанр) (3-5 книг). После, используя известный нам метод массив, добавить еще одну книгу в конец 
// списка. Можете заменить книги на фильмы, или другую сущность, идею вы поняли.

const books = [
  {
    title:"Арабы",
    author:"Юджин Роган",
    year:"2020",
    cover:"Твердый переплет",
    genre:"Исторический"
  },
  {
    title:"Финансист",
    author:"Теодор Драйзер",
    year:"1912",
    cover:"Мягкий переплет",
    genre:"Роман"
  },
  {
    title:"Разьеснение четырех правил",
    author:"ШЕЙХУЛЬ ИСЛЯМ МУХАММАД ИБН СУЛЕИМАН АТ-ТАМИМИ",
    year:"2026",
    cover:"Твердый переплет",
    genre:"Религия"
  },
  {
    title:"Путь Абая",
    author:"Мухтар Ауезов",
    year:"1942",
    cover:"Твердый переплет",
    genre:"История"
  }
]

const newBook = {
  title:"РАЗЪЯСНЕНИЕ НЕКОТОРЫХ ПОЛЬЗ СУРЫ АЛЬ-ФАТИХА",
  author:"МУХАММАД ИБН СУЛЕЙМАН АТ-ТАМИМИ",
  year:"2026",
  cover:"Мягкий переплет",
  genre:"Религия"
}

books.push(newBook);
console.log(books);

//Создать еще один массив, состоящих из тех же книг, но относящийся к определенной вселенной (Гарри Поттер, 
// Марвел и так далее). (Если используете другую, свою сущность - импровизируйте). С помощью известного нам 
// метода массива или оператора (рекомендую использовать оператор), объединить эти два массива в один

const booksRings = [
  {
    title:"Хранители Кольца",
    author:"Дж. Р. Р. Толкин",
    year:"1954",
    cover:"Мягкий переплет",
    genre:"Фэнтези"
  },
  {
    title:"Две крепости",
    author:"Дж. Р. Р. Толкин",
    year:"1954",
    cover:"Мягкий переплет",
    genre:"Фэнтези"
  },
  {
    title:"Возвращение короля",
    author:"Дж. Р. Р. Толкин",
    year:"1955",
    cover:"Мягкий переплет",
    genre:"Фэнтези"
  }
]

const allBooks = [...books, ...booksRings]
console.log(allBooks);

//Почитать про метод массива — map. Написать функцию, которая принимает массив сущностей с задания №9. 
// Добавляем новое свойство для объекта "isRare (это редкий)" и в зависимости от года выпуска книги 
// (или какой-то логики, связанной с вашей сущностью), устанавливаем true или false. Что я хочу этим сказать: 
// если книга выпущена позже 2000 года, устанавливаем true (да, это редкий), нет - false (значит это не редкий).

const booksYear = booksRings.map(bookRings => bookRings.year);
const booksIsRare = booksYear.map(booksYear => booksYear < 1955);

console.log(booksYear);
console.log(booksIsRare);
