//Создать функцию, которая принимает 2 параметра: город и температуру и выводит сообщение в консоль 
// "Сейчас в X температура — Y градусов по Цельсию"

function display_temperature(city, temperature) {
  console.log(`Сейчас в ${city} температура — ${temperature} градусов по Цельсию`)
}

display_temperature('Медине', 50);
//---------------------------------------
const display_temperature_2 = (city, temperature) => {
  console.log(`Сейчас в ${city} температура — ${temperature} градусов по Цельсию`);
}

display_temperature_2('Алматы', 35);

//Создать переменную, которая хранит внутри себя скорость света (гуглим). Создать функцию, которая принимает 1 
// аргумент - скорость, внутри функции происходит проверка: если переданная скорость выше скорости света — 
// выводим лог "Сверхсветовая скорость", если ниже — "Субсветовая скорость"? если равна — "Скорость света"

const speedOfLight = 299792458;

function getSpeed(speedArgument) {
  if (speedArgument > speedOfLight) {
    console.log('Сверхсветовая скорость')
  } else if (speedArgument < speedOfLight) {
      console.log('Субсветовая скорость')
  } else {console.log('Скорость света')}
}

getSpeed(2997924581);
//---------------------------------------

const getSpeed2 = (speedArgument2) => {
  if (speedArgument2 > speedOfLight) {
    console.log('Сверхсветовая скорость')
  } else if (speedArgument2 < speedOfLight) {
  console.log('Субсветовая скорость')
  } else {console.log('Скорость света')}
}

getSpeed2(299792458);

//Создать переменную №1, которая содержит продукт и переменную №2, которая содержит его цену (на ваше усмотрение). 
// Далее создаем функцию, которая принимает 1 параметр - текущий бюджет, внутри функции происходит проверка: 
// если бюджет превышает цену товара - выводим лог "(ваше название товара) приобретён. Спасибо за покупку!", 
// если нет - обсчитываем разницу и выводим лог "Вам не хватает X$, пополните баланс". То-есть с помощью функции 
// мы пытаемся приобрести товар.

const home = "Дом в центре города";
const price = 100000;

function buy(budget) {
  if (budget >= price) {
    console.log(`${home} приобретён. Спасибо за покупку!`)
  } else {
    let difference = price - budget;
    console.log(`Вам не хватает ${difference}$, пополните баланс`)
  }
}

buy(80000)
//---------------------------------------
const home2 = "Квартира в Медине";
const price2 = 200000;

const buy2 = budget2 => {
  budget2 >= price2 
    ? console.log(`${home2} приобретён. Спасибо за покупку!`) 
    : console.log(`Вам не хватает ${x}$, пополните баланс`)
}

buy2(800000)

//Создать 1 функцию и именовать её по своему усмотрению
//принимает имя и время суток (утро/день/вечер/ночь), выдавая вежливое сообщение.

const greetUser = (name, timeOfDay) => {
  if (timeOfDay >= '04:00' && timeOfDay < '11:00') {
    console.log(`Доброе утро ${name}!`);
    } else if (timeOfDay >= '11:00' && timeOfDay < '16:00') {
    console.log(`Добрый день ${name}!`);
    }
    else if (timeOfDay >= '16:00' && timeOfDay < '22:00') {
    console.log(`Добрый вечер ${name}!`);
    }
    else { console.log(`Доброй ночи ${name}!`);
    }
  }

greetUser('Асет', '02:00')

//Создать 3 переменных (без разницы каких) и именовать их по своему усмотрению

let width = 2;
const square = 1000;
let city = 'Medina';